## DataFramePandas

In [135]:
import numpy as np
import pandas as pd

In [136]:
data=np.random.randn(4,3)

In [137]:
data

array([[-2.04580005,  1.14446796, -0.33238217],
       [ 0.90431958,  0.35938353, -1.0270166 ],
       [-0.47910505, -0.98883697,  0.14761721],
       [-0.92542264, -0.77723642, -0.73324939]])

In [138]:
yeniDataFrame=pd.DataFrame(data)

In [139]:
yeniDataFrame

          0         1         2
0 -2.045800  1.144468 -0.332382
1  0.904320  0.359384 -1.027017
2 -0.479105 -0.988837  0.147617
3 -0.925423 -0.777236 -0.733249

In [140]:
yeniDataFrame2=pd.DataFrame(data,index=["Ali","Hadi","Elif","Gamze"],columns=["maas","yas","calısma saati"])

In [141]:
yeniDataFrame2

           maas       yas  calısma saati
Ali   -2.045800  1.144468      -0.332382
Hadi   0.904320  0.359384      -1.027017
Elif  -0.479105 -0.988837       0.147617
Gamze -0.925423 -0.777236      -0.733249

In [142]:
yeniDataFrame2["maas"]

Ali     -2.045800
Hadi     0.904320
Elif    -0.479105
Gamze   -0.925423
Name: maas, dtype: float64

In [143]:
yeniDataFrame2[["maas","calısma saati"]]

           maas  calısma saati
Ali   -2.045800      -0.332382
Hadi   0.904320      -1.027017
Elif  -0.479105       0.147617
Gamze -0.925423      -0.733249

In [144]:
yeniDataFrame2.loc["Ali"]

maas            -2.045800
yas              1.144468
calısma saati   -0.332382
Name: Ali, dtype: float64

In [145]:
yeniDataFrame2.loc["Gamze"]

maas            -0.925423
yas             -0.777236
calısma saati   -0.733249
Name: Gamze, dtype: float64

In [146]:
yeniDataFrame2.iloc[0]

maas            -2.045800
yas              1.144468
calısma saati   -0.332382
Name: Ali, dtype: float64

In [147]:
yeniDataFrame2.iloc[3]

maas            -0.925423
yas             -0.777236
calısma saati   -0.733249
Name: Gamze, dtype: float64

In [148]:
yeniDataFrame2

           maas       yas  calısma saati
Ali   -2.045800  1.144468      -0.332382
Hadi   0.904320  0.359384      -1.027017
Elif  -0.479105 -0.988837       0.147617
Gamze -0.925423 -0.777236      -0.733249

In [149]:
yeniDataFrame2["Emeklilik yasi"]= yeniDataFrame2["yas"]*2

In [150]:
yeniDataFrame2

           maas       yas  calısma saati  Emeklilik yasi
Ali   -2.045800  1.144468      -0.332382        2.288936
Hadi   0.904320  0.359384      -1.027017        0.718767
Elif  -0.479105 -0.988837       0.147617       -1.977674
Gamze -0.925423 -0.777236      -0.733249       -1.554473

In [151]:
yeniDataFrame2

           maas       yas  calısma saati  Emeklilik yasi
Ali   -2.045800  1.144468      -0.332382        2.288936
Hadi   0.904320  0.359384      -1.027017        0.718767
Elif  -0.479105 -0.988837       0.147617       -1.977674
Gamze -0.925423 -0.777236      -0.733249       -1.554473

In [152]:
yeniDataFrame2.drop("Emeklilik yasi",axis=1)

           maas       yas  calısma saati
Ali   -2.045800  1.144468      -0.332382
Hadi   0.904320  0.359384      -1.027017
Elif  -0.479105 -0.988837       0.147617
Gamze -0.925423 -0.777236      -0.733249

In [153]:
yeniDataFrame2.drop("Hadi",axis=0)

           maas       yas  calısma saati  Emeklilik yasi
Ali   -2.045800  1.144468      -0.332382        2.288936
Elif  -0.479105 -0.988837       0.147617       -1.977674
Gamze -0.925423 -0.777236      -0.733249       -1.554473

In [154]:
yeniDataFrame2.drop("Emeklilik yasi",axis=1,inplace=False) #### inplace True olunca direk siliyor false diyince silinmiş halinin kopyasını gösterir yada o kopyayı başka bir tablo olarak kaydedersin

           maas       yas  calısma saati
Ali   -2.045800  1.144468      -0.332382
Hadi   0.904320  0.359384      -1.027017
Elif  -0.479105 -0.988837       0.147617
Gamze -0.925423 -0.777236      -0.733249

In [155]:
yeniDataFrame2

           maas       yas  calısma saati  Emeklilik yasi
Ali   -2.045800  1.144468      -0.332382        2.288936
Hadi   0.904320  0.359384      -1.027017        0.718767
Elif  -0.479105 -0.988837       0.147617       -1.977674
Gamze -0.925423 -0.777236      -0.733249       -1.554473

In [156]:
yeniDataFrame2.drop("Emeklilik yasi",axis=1,inplace=True)

In [157]:
yeniDataFrame2

           maas       yas  calısma saati
Ali   -2.045800  1.144468      -0.332382
Hadi   0.904320  0.359384      -1.027017
Elif  -0.479105 -0.988837       0.147617
Gamze -0.925423 -0.777236      -0.733249

In [158]:
yeniDataFrame2.loc["Ali"]["yas"]

1.1444679579462618

In [159]:
yeniDataFrame2.loc["Elif","yas"]

-0.9888369730612709

In [160]:
yeniDataFrame2<0

        maas    yas  calısma saati
Ali     True  False           True
Hadi   False  False           True
Elif    True   True          False
Gamze   True   True           True

In [161]:
booleanFrame=yeniDataFrame2<0

In [162]:
booleanFrame

        maas    yas  calısma saati
Ali     True  False           True
Hadi   False  False           True
Elif    True   True          False
Gamze   True   True           True

In [163]:
yeniDataFrame2[booleanFrame]

           maas       yas  calısma saati
Ali   -2.045800       NaN      -0.332382
Hadi        NaN       NaN      -1.027017
Elif  -0.479105 -0.988837            NaN
Gamze -0.925423 -0.777236      -0.733249

In [164]:
yeniDataFrame2[yeniDataFrame2<0]

           maas       yas  calısma saati
Ali   -2.045800       NaN      -0.332382
Hadi        NaN       NaN      -1.027017
Elif  -0.479105 -0.988837            NaN
Gamze -0.925423 -0.777236      -0.733249

In [165]:
yeniDataFrame2[yeniDataFrame2["yas"]>0]

         maas       yas  calısma saati
Ali  -2.04580  1.144468      -0.332382
Hadi  0.90432  0.359384      -1.027017

In [166]:
yeniDataFrame2[yeniDataFrame2["calısma saati"]>0]

          maas       yas  calısma saati
Elif -0.479105 -0.988837       0.147617

In [167]:
yeniDataFrame2

           maas       yas  calısma saati
Ali   -2.045800  1.144468      -0.332382
Hadi   0.904320  0.359384      -1.027017
Elif  -0.479105 -0.988837       0.147617
Gamze -0.925423 -0.777236      -0.733249

## İndex değiştirme

In [168]:
yeniDataFrame2.reset_index()

   index      maas       yas  calısma saati
0    Ali -2.045800  1.144468      -0.332382
1   Hadi  0.904320  0.359384      -1.027017
2   Elif -0.479105 -0.988837       0.147617
3  Gamze -0.925423 -0.777236      -0.733249

In [169]:
yeniDataFrame2

           maas       yas  calısma saati
Ali   -2.045800  1.144468      -0.332382
Hadi   0.904320  0.359384      -1.027017
Elif  -0.479105 -0.988837       0.147617
Gamze -0.925423 -0.777236      -0.733249

In [170]:
yeniIndexListesi=["A","H","E","G"]

In [171]:
yeniDataFrame2["Yeni index"]=yeniIndexListesi

In [172]:
yeniDataFrame2

           maas       yas  calısma saati Yeni index
Ali   -2.045800  1.144468      -0.332382          A
Hadi   0.904320  0.359384      -1.027017          H
Elif  -0.479105 -0.988837       0.147617          E
Gamze -0.925423 -0.777236      -0.733249          G

In [173]:
yeniDataFrame2.set_index("Yeni index")

                maas       yas  calısma saati
Yeni index
A          -2.045800  1.144468      -0.332382
H           0.904320  0.359384      -1.027017
E          -0.479105 -0.988837       0.147617
G          -0.925423 -0.777236      -0.733249

In [175]:
yeniDataFrame2

           maas       yas  calısma saati Yeni index
Ali   -2.045800  1.144468      -0.332382          A
Hadi   0.904320  0.359384      -1.027017          H
Elif  -0.479105 -0.988837       0.147617          E
Gamze -0.925423 -0.777236      -0.733249          G

In [176]:
yeniDataFrame2.set_index("Yeni index",inplace=True)

In [177]:
yeniDataFrame2

                maas       yas  calısma saati
Yeni index
A          -2.045800  1.144468      -0.332382
H           0.904320  0.359384      -1.027017
E          -0.479105 -0.988837       0.147617
G          -0.925423 -0.777236      -0.733249

In [184]:
yeniDataFrame2.iloc[0]

maas            -2.045800
yas              1.144468
calısma saati   -0.332382
Name: A, dtype: float64

In [187]:
yeniDataFrame2.loc["H"]

maas             0.904320
yas              0.359384
calısma saati   -1.027017
Name: H, dtype: float64

## Multi index

In [211]:
soyisim=["Simpson","Simpson","Simpson","Sout Park","Sout Park","Sout Park"]

In [212]:
isim=["Homer","Bart","Marge","Kartman","Keny","Kayle"]

In [213]:
birlesmisTuple=list(zip(soyisim,isim))

In [214]:
birlesmisTuple

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('Sout Park', 'Kartman'),
 ('Sout Park', 'Keny'),
 ('Sout Park', 'Kayle')]

In [216]:
birlesmisTuple=pd.MultiIndex.from_tuples(birlesmisTuple)

In [218]:
birlesmisTuple

MultiIndex([(  'Simpson',   'Homer'),
            (  'Simpson',    'Bart'),
            (  'Simpson',   'Marge'),
            ('Sout Park', 'Kartman'),
            ('Sout Park',    'Keny'),
            ('Sout Park',   'Kayle')],
           )

In [219]:
yasMeslekDatası=[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [220]:
multiIndexDataFrame=pd.DataFrame(yasMeslekDatası,index=birlesmisTuple,columns=["Yas","Meslek"])

In [221]:
multiIndexDataFrame

                   Yas Meslek
Simpson   Homer     40      A
          Bart      10      B
          Marge     30      C
Sout Park Kartman    9      D
          Keny      10      E
          Kayle     11      F

In [228]:
multiIndexDataFrame.loc["Simpson"]## homer yazınca hata veriyo ama iloc ile çağırınca 0,1,2,3,4,5 leri ayrı ayrı yazıyor

       Yas Meslek
Homer   40      A
Bart    10      B
Marge   30      C

In [238]:
multiIndexDataFrame.loc["Simpson"].loc["Bart"]

Yas       10
Meslek     B
Name: Bart, dtype: object

In [239]:
multiIndexDataFrame

                   Yas Meslek
Simpson   Homer     40      A
          Bart      10      B
          Marge     30      C
Sout Park Kartman    9      D
          Keny      10      E
          Kayle     11      F

In [243]:
multiIndexDataFrame.index.names=["Soy isim","isim"]

In [244]:
multiIndexDataFrame

                   Yas Meslek
Soy isim  isim
Simpson   Homer     40      A
          Bart      10      B
          Marge     30      C
Sout Park Kartman    9      D
          Keny      10      E
          Kayle     11      F